PROCEDURE dapin

IF !DIRECTORY("c:\dapiny")
    MD c:\dapiny\county
ENDIF

DIMENSION ds[31]

ds[1]=''
ds[2]='01'
ds[3]='02'
ds[4]='03'
ds[5]='04'
ds[6]='05'
ds[7]='06'
ds[8]='07'
ds[9]='08'
ds[10]='09'
ds[11]='10'
ds[12]='11'
ds[13]='12'
ds[14]='13'
ds[15]='14'
ds[16]='15'
ds[17]='16'
ds[18]='17'
ds[19]='18'
ds[20]='19'
ds[21]='28'
ds[22]='35'
ds[23]='37'
ds[24]='38'
ds[25]='39'
ds[26]='41'
ds[27]='42'
ds[28]='43'
ds[29]='44'
ds[30]='45'

lcUrl = "http://bm.hnsgkb.com/dxhuah_getNumberOfPeople.tc?no1code="
oHtml = Createobject("MicroSoft.XmlHttp")

FOR i=1 TO 30
	oHtml.Open([Get],lcUrl+ds[i],.F.)
	TRY
		oHtml.Send(null)
	CATCH
	FINALLY
	ENDTRY

	IF oHtml.status=200&&下载网上资源，若不存在，从缓存查找，成功200
		= StrToFile(oHtml.ResponseText,"c:\dapiny\"+IIF(EMPTY(ds[i]),"00",ds[i])+".json")  &&下载文本文件
	ENDIF
ENDFOR



**
DIMENSION ds[146]

ds[1]='02001'
ds[2]='02002'
ds[3]='02003'
ds[4]='02004'
ds[5]='02005'
ds[6]='02007'
ds[7]='02008'

ds[8]='03001'
ds[9]='03003'
ds[10]='03005'
ds[11]='03006'
ds[12]='03013'

ds[13]='04001'
ds[14]='04005'
ds[15]='04007'
ds[16]='04008'
ds[17]='04009'
ds[18]='04010'
ds[19]='04011'
ds[20]='04012'
ds[21]='04013'
ds[22]='04014'
ds[23]='04015'

ds[24]='05001'
ds[25]='05004'
ds[26]='05005'
ds[27]='05006'
ds[28]='05007'
ds[29]='05008'
ds[30]='05010'

ds[31]='06001'
ds[32]='06003'
ds[33]='06004'
ds[34]='06005'
ds[35]='06006'
ds[36]='06007'
ds[37]='06008'
ds[38]='06009'
ds[39]='06010'
ds[40]='06011'
ds[41]='06012'
ds[42]='06013'

ds[43]='07001'
ds[44]='07002'
ds[45]='07003'
ds[46]='07004'
ds[47]='07005'
ds[48]='07006'
ds[49]='07007'
ds[50]='07008'
ds[51]='07009'
ds[52]='07010'
ds[53]='07011'

ds[54]='08001'
ds[55]='08002'
ds[56]='08004'
ds[57]='08005'
ds[58]='08006'
ds[59]='08007'

ds[60]='09001'
ds[61]='09002'
ds[62]='09003'
ds[63]='09004'
ds[64]='09005'
ds[65]='09006'

ds[66]='10001'
ds[67]='10002'
ds[68]='10003'
ds[69]='10004'
ds[70]='10005'
ds[71]='10007'
ds[72]='10008'
ds[73]='10010'
ds[74]='10011'

ds[75]='11001'
ds[76]='11002'
ds[77]='11003'
ds[78]='11004'
ds[79]='11005'
ds[80]='11006'
ds[81]='11007'

ds[82]='12001'
ds[83]='12002'
ds[84]='12003'
ds[85]='12004'
ds[86]='12005'
ds[87]='12006'
ds[88]='12007'

ds[89]='13001'
ds[90]='13002'
ds[91]='13003'
ds[92]='13004'
ds[93]='13005'
ds[94]='13006'

ds[95]='14001'
ds[96]='14002'
ds[97]='14004'
ds[98]='14005'
ds[99]='14006'
ds[100]='14007'
ds[101]='14008'
ds[102]='14009'
ds[103]='14010'

ds[104]='15001'
ds[105]='15002'
ds[106]='15003'
ds[107]='15005'
ds[108]='15006'
ds[109]='15008'
ds[110]='15009'
ds[111]='15010'
ds[112]='15011'
ds[113]='15012'

ds[114]='16001'
ds[115]='16002'
ds[116]='16003'
ds[117]='16004'
ds[118]='16005'
ds[119]='16006'
ds[120]='16007'
ds[121]='16009'
ds[122]='16010'
ds[123]='16011'

ds[124]='17001'
ds[125]='17002'
ds[126]='17003'
ds[127]='17004'
ds[128]='17005'
ds[129]='17006'
ds[130]='17008'
ds[131]='17009'
ds[132]='17010'
ds[133]='17011'

ds[134]='18001'
ds[135]='18002'
ds[136]='18003'
ds[137]='18004'
ds[138]='18005'
ds[139]='18006'
ds[140]='18007'
ds[141]='18008'
ds[142]='18009'
ds[143]='18010'
ds[144]='18011'
ds[145]='18012'
ds[146]='18013'


lcUrl = "http://bm.hnsgkb.com/dxhuah_getNumberOfPeople.tc?no1code="
oHtml = Createobject("MicroSoft.XmlHttp")

FOR i=1 TO 146
	oHtml.Open([Get],lcUrl+ds[i],.F.)
	TRY
		oHtml.Send(null)
	CATCH
	FINALLY
	ENDTRY

	IF oHtml.status=200&&下载网上资源，若不存在，从缓存查找，成功200
		= StrToFile(oHtml.ResponseText,"c:\dapiny\county\"+IIF(EMPTY(ds[i]),"00",ds[i])+".json")  &&下载文本文件
	ENDIF
ENDFOR

oHtml=.null.
RELEASE oHtml

MESSAGEBOX("大屏数据已生存，存在‘c:\dapiny’目录下",2000)