FUNCTION tgcodesm
PARAMETERS tcCode

LOCAL m.cexpr
DO case
CASE tcCode="1"
    m.cexpr="现职务套改级别高于原任低一级职务套改级别，但级别工资额低于按原任低一级职务套改的级别工资额：按原任低一级职务套改的级别工资额就近就高套入现职务套改级别对应的工资标准"
CASE tcCode="1B"
    m.cexpr="现职务低于转业时部队职务, 且转业时职务套改级别高于原任低一级职务套改级别, 但级别工资额低于按原任低一级职务套改的级别工资额：按原任低一级职务套改的级别工资额就近就高套入现职务套改级别对应的工资标准"
CASE tcCode="2"
    m.cexpr="现职务套改级别低于或等于原任低一级职务套改级别：先按原任低一级职务套改, 在此基础上高套一个级别, 级别工资就近就高套入对应的工资标准"
CASE tcCode="2B"
    m.cexpr="现职务低于转业时部队职务, 且转业时职务套改级别低于或等于原任低一级职务套改级别：在按原任低一级职务套改的基础上, 级别再高定一级, 并按两职务套改较高的级别工资额就近就高套入该级别"
CASE tcCode="B"
    m.cexpr="现职务低于或同于转业时部队职务：按转业时部队职务套改"
CASE tcCode="3"
    m.cexpr="机关工人现任技术等级(职务)套改的岗位工资额低于或等于按原任低一技术等级(职务)套改的岗位工资额：先按原任低一技术等级(职务)套改，再就近就高套入现任技术等级(职务)对应的工资标准"
CASE tcCode="4"
    m.cexpr="现职务套改薪级低于前一级职务套改薪级：薪级按前一级职务套改的薪级"
CASE tcCode="X"
    m.cexpr="按学历转正定级的结果高于按职务套改的结果：按学历套改"
CASE tcCode="J"
    m.cexpr=""
CASE tcCode="C"
*!*	    IF EMPTY(lsk.zwbm2)
*!*	        m.cexpr="缺少任职简历信息, 未套改"
*!*	    ELSE
*!*	        m.cexpr="任职简历信息有误, 未套改"
*!*	    ENDIF
        m.cexpr="套改出错(原因:任职简历,套改年限)"

OTHERWISE
    m.cexpr="按现任职务套改"
ENDCASE

RETURN m.cexpr